kavionic/PadOS/Kernel/HAL/STM32/ResetAndClockControl.cpp
// This file is part of PadOS.
//
// Copyright (c) 2022 Kurt Skauen
//
// SPDX-License-Identifier: Apache-2.0
///////////////////////////////////////////////////////////////////////////////
// Created: 14.04.2022 15:30

#ifdef STM32H7

#include <stm32h7xx.h>
#include <iterator>

#include "Kernel/HAL/STM32/ResetAndClockControl.h"
#include "Utils/Utils.h"

uint32_t ResetAndClockControl::s_HSEFrequency = 0;


///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

ClockMuxInfo::ClockMuxInfo(__IO uint32_t* InRegister, uint32_t InValueMask, uint32_t InValuePosition,
                           const ClockSourceInfo* InSources, uint32_t InSourceCount)
: Register(InRegister)
, ValueMask(InValueMask)
, ValuePosition(InValuePosition)
, Sources(InSources)
, SourceCount(InSourceCount)
{

}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetHSEFrequency(uint32_t freq)
{
    s_HSEFrequency = freq;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::EnableClock(RCC_ClockID clock, bool enable, bool waitForStartup)
{
    if (enable)
    {
        switch (clock)
        {
            case RCC_ClockID::HSE:  RCC->CR |= RCC_CR_HSEON;    break;
            case RCC_ClockID::LSE:
                PWR->CR1 |= PWR_CR1_DBP; // Disable Back-up domain protection.
                RCC->BDCR |= RCC_BDCR_LSEON;
                PWR->CR1 &= ~PWR_CR1_DBP; // Enable Back-up domain protection.
                break;
            case RCC_ClockID::HSI:  RCC->CR  |= RCC_CR_HSION;   break;
            case RCC_ClockID::CSI:  RCC->CR  |= RCC_CR_CSION;   break;
            case RCC_ClockID::LSI:  RCC->CSR |= RCC_CSR_LSION;  break;
        }
        if (waitForStartup)
        {
            WaitForClockStartup(clock);
        }
    }
    else
    {
        switch (clock)
        {
            case RCC_ClockID::HSE:  RCC->CR  &= ~RCC_CR_HSEON;  break;
            case RCC_ClockID::LSE:
                PWR->CR1 |= PWR_CR1_DBP; // Disable Back-up domain protection.
                RCC->BDCR &= ~RCC_BDCR_LSEON;
                PWR->CR1 &= ~PWR_CR1_DBP; // Enable Back-up domain protection.
                break;
            case RCC_ClockID::HSI:  RCC->CR  &= ~RCC_CR_HSION;  break;
            case RCC_ClockID::CSI:  RCC->CR  &= ~RCC_CR_CSION;  break;
            case RCC_ClockID::LSI:  RCC->CSR &= ~RCC_CSR_LSION; break;
        }
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

bool ResetAndClockControl::IsClockEnabled(RCC_ClockID clock)
{
    switch (clock)
    {
        case RCC_ClockID::HSE:  return (RCC->CR   & RCC_CR_HSEON)   != 0;
        case RCC_ClockID::LSE:  return (RCC->BDCR & RCC_BDCR_LSEON) != 0;
        case RCC_ClockID::HSI:  return (RCC->CR   & RCC_CR_HSION)   != 0;
        case RCC_ClockID::CSI:  return (RCC->CR   & RCC_CR_CSION)   != 0;
        case RCC_ClockID::LSI:  return (RCC->CSR  & RCC_CSR_LSION)  != 0;
    }
    return false;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::WaitForClockStartup(RCC_ClockID clock)
{
    if (IsClockEnabled(clock))
    {
        switch (clock)
        {
            case RCC_ClockID::HSE:  while ((RCC->CR   & RCC_CR_HSERDY)   == 0) {} break;
            case RCC_ClockID::LSE:  while ((RCC->BDCR & RCC_BDCR_LSERDY) == 0) {} break;
            case RCC_ClockID::HSI:  while ((RCC->CR   & RCC_CR_HSIRDY)   == 0) {} break;
            case RCC_ClockID::CSI:  while ((RCC->CR   & RCC_CR_CSIRDY)   == 0) {} break;
            case RCC_ClockID::LSI:  while ((RCC->CSR  & RCC_CSR_LSIRDY)  == 0) {} break;
        }
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetHSIFrequency()
{
    switch (RCC->CR & RCC_CR_HSIDIV_Msk)
    {
        case RCC_CR_HSIDIV_1:   return 64000000;
        case RCC_CR_HSIDIV_2:   return 32000000;
        case RCC_CR_HSIDIV_4:   return 16000000;
        case RCC_CR_HSIDIV_8:   return 8000000;
    }
    return 0;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetHSEFrequency()
{
    return s_HSEFrequency;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetSysClockFrequency()
{
    switch (RCC->CFGR & RCC_CFGR_SWS_Msk)
    {
        case RCC_CFGR_SWS_HSI:  return GetHSIFrequency();
        case RCC_CFGR_SWS_CSI:  return 4000000;
        case RCC_CFGR_SWS_HSE:  return s_HSEFrequency;
        case RCC_CFGR_SWS_PLL1: return GetPLLOutFrequency(RCC_PLLID::PLL1, RCC_PLLDivider::DIVP);
    }
    return 0;
}

///////////////////////////////////////////////////////////////////////////////
/// Decodes the AHB pre-scaler from a 4-bit field value (shifted to bit 0).
/// 
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

static uint32_t DecodeAHBPrescalerField(uint32_t fieldValue)
{
    switch (fieldValue)
    {
        case 8:  return 2;
        case 9:  return 4;
        case 10: return 8;
        case 11: return 16;
        case 12: return 64;
        case 13: return 128;
        case 14: return 256;
        case 15: return 512;
        default: return 1;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// Decodes the APB pre-scaler from a 3-bit field value (shifted to bit 0).
/// 
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

static uint32_t DecodeAPBPrescalerField(uint32_t fieldValue)
{
    switch (fieldValue)
    {
        case 4: return 2;
        case 5: return 4;
        case 6: return 8;
        case 7: return 16;
        default: return 1;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetHCLKFrequency()
{
    const uint32_t d1cpre = DecodeAHBPrescalerField((RCC->D1CFGR & RCC_D1CFGR_D1CPRE_Msk) >> RCC_D1CFGR_D1CPRE_Pos);
    const uint32_t hpre   = DecodeAHBPrescalerField((RCC->D1CFGR & RCC_D1CFGR_HPRE_Msk)   >> RCC_D1CFGR_HPRE_Pos);
    return GetSysClockFrequency() / d1cpre / hpre;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetPCLK1Frequency()
{
    return GetHCLKFrequency() / DecodeAPBPrescalerField((RCC->D2CFGR & RCC_D2CFGR_D2PPRE1_Msk) >> RCC_D2CFGR_D2PPRE1_Pos);
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetPCLK2Frequency()
{
    return GetHCLKFrequency() / DecodeAPBPrescalerField((RCC->D2CFGR & RCC_D2CFGR_D2PPRE2_Msk) >> RCC_D2CFGR_D2PPRE2_Pos);
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetPCLK4Frequency()
{
    return GetHCLKFrequency() / DecodeAPBPrescalerField((RCC->D3CFGR & RCC_D3CFGR_D3PPRE_Msk) >> RCC_D3CFGR_D3PPRE_Pos);
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetClockSourceFrequency(const ClockSourceInfo& source)
{
    using ST = ClockSourceInfo::SourceType;
    switch (source.Type)
    {
        case ST::Disabled:      return 0;
        case ST::Fixed:         return source.FixedFreq;
        case ST::HSI:           return GetHSIFrequency();
        case ST::HSI_div8:      return GetHSIFrequency() / 8;
        case ST::HSE:           return s_HSEFrequency;
        case ST::HSE_RTC:
        {
            const uint32_t rtcpre = (RCC->CFGR & RCC_CFGR_RTCPRE_Msk) >> RCC_CFGR_RTCPRE_Pos;
            return (rtcpre > 0) ? s_HSEFrequency / rtcpre : 0;
        }
        case ST::CSI:           return 4000000;
        case ST::LSE:           return 32768;
        case ST::LSI:           return 32000;
        case ST::PLL:           return GetPLLOutFrequency(source.PLLID, source.PLLDiv);
        case ST::SysClock:      return GetSysClockFrequency();
        case ST::HCLK:          return GetHCLKFrequency();
        case ST::PCLK1:         return GetPCLK1Frequency();
        case ST::PCLK2:         return GetPCLK2Frequency();
        case ST::PCLK4:         return GetPCLK4Frequency();
        case ST::PeriphClock:   return GetClockFrequency(GetClockMux<RCC_ClockMux_CKPERSEL>());
        case ST::I2SCkin:       return 0;
    }
    return 0;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPLLSource(RCC_PLLSource source)
{
    set_bit_group(RCC->PLLCKSELR, RCC_PLLCKSELR_PLLSRC_Msk, uint32_t(source) << RCC_PLLCKSELR_PLLSRC_Pos);
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

RCC_PLLSource ResetAndClockControl::GetPLLSource()
{
    return RCC_PLLSource((RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC_Msk) >> RCC_PLLCKSELR_PLLSRC_Pos);
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPLLDivider(RCC_PLLID pll, RCC_PLLDivider divider, uint32_t value)
{
    switch (pll)
    {
        case RCC_PLLID::PLL1:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  set_bit_group(RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM1_Msk, value << RCC_PLLCKSELR_DIVM1_Pos);   break;
                case RCC_PLLDivider::DIVN:  set_bit_group(RCC->PLL1DIVR, RCC_PLL1DIVR_N1_Msk, (value - 1) << RCC_PLL1DIVR_N1_Pos);   break;
                case RCC_PLLDivider::DIVP:  set_bit_group(RCC->PLL1DIVR, RCC_PLL1DIVR_P1_Msk, (value - 1) << RCC_PLL1DIVR_P1_Pos);   break;
                case RCC_PLLDivider::DIVQ:  set_bit_group(RCC->PLL1DIVR, RCC_PLL1DIVR_Q1_Msk, (value - 1) << RCC_PLL1DIVR_Q1_Pos);   break;
                case RCC_PLLDivider::DIVR:  set_bit_group(RCC->PLL1DIVR, RCC_PLL1DIVR_R1_Msk, (value - 1) << RCC_PLL1DIVR_R1_Pos);   break;
            }
            break;
        case RCC_PLLID::PLL2:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  set_bit_group(RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM2_Msk, value << RCC_PLLCKSELR_DIVM2_Pos);   break;
                case RCC_PLLDivider::DIVN:  set_bit_group(RCC->PLL2DIVR, RCC_PLL2DIVR_N2_Msk, (value - 1) << RCC_PLL2DIVR_N2_Pos);   break;
                case RCC_PLLDivider::DIVP:  set_bit_group(RCC->PLL2DIVR, RCC_PLL2DIVR_P2_Msk, (value - 1) << RCC_PLL2DIVR_P2_Pos);   break;
                case RCC_PLLDivider::DIVQ:  set_bit_group(RCC->PLL2DIVR, RCC_PLL2DIVR_Q2_Msk, (value - 1) << RCC_PLL2DIVR_Q2_Pos);   break;
                case RCC_PLLDivider::DIVR:  set_bit_group(RCC->PLL2DIVR, RCC_PLL2DIVR_R2_Msk, (value - 1) << RCC_PLL2DIVR_R2_Pos);   break;
            }
            break;
        case RCC_PLLID::PLL3:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  set_bit_group(RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM3_Msk, value << RCC_PLLCKSELR_DIVM3_Pos);   break;
                case RCC_PLLDivider::DIVN:  set_bit_group(RCC->PLL3DIVR, RCC_PLL3DIVR_N3_Msk, (value - 1) << RCC_PLL3DIVR_N3_Pos);   break;
                case RCC_PLLDivider::DIVP:  set_bit_group(RCC->PLL3DIVR, RCC_PLL3DIVR_P3_Msk, (value - 1) << RCC_PLL3DIVR_P3_Pos);   break;
                case RCC_PLLDivider::DIVQ:  set_bit_group(RCC->PLL3DIVR, RCC_PLL3DIVR_Q3_Msk, (value - 1) << RCC_PLL3DIVR_Q3_Pos);   break;
                case RCC_PLLDivider::DIVR:  set_bit_group(RCC->PLL3DIVR, RCC_PLL3DIVR_R3_Msk, (value - 1) << RCC_PLL3DIVR_R3_Pos);   break;
            }
            break;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

uint32_t ResetAndClockControl::GetPLLDivider(RCC_PLLID pll, RCC_PLLDivider divider)
{
    switch (pll)
    {
        case RCC_PLLID::PLL1:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  return ((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM1_Msk) >> RCC_PLLCKSELR_DIVM1_Pos);
                case RCC_PLLDivider::DIVN:  return ((RCC->PLL1DIVR & RCC_PLL1DIVR_N1_Msk) >> RCC_PLL1DIVR_N1_Pos) + 1;
                case RCC_PLLDivider::DIVP:  return ((RCC->PLL1DIVR & RCC_PLL1DIVR_P1_Msk) >> RCC_PLL1DIVR_P1_Pos) + 1;
                case RCC_PLLDivider::DIVQ:  return ((RCC->PLL1DIVR & RCC_PLL1DIVR_Q1_Msk) >> RCC_PLL1DIVR_Q1_Pos) + 1;
                case RCC_PLLDivider::DIVR:  return ((RCC->PLL1DIVR & RCC_PLL1DIVR_R1_Msk) >> RCC_PLL1DIVR_R1_Pos) + 1;
            }
            break;
        case RCC_PLLID::PLL2:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  return ((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM2_Msk) >> RCC_PLLCKSELR_DIVM2_Pos);
                case RCC_PLLDivider::DIVN:  return ((RCC->PLL2DIVR & RCC_PLL2DIVR_N2_Msk) >> RCC_PLL2DIVR_N2_Pos) + 1;
                case RCC_PLLDivider::DIVP:  return ((RCC->PLL2DIVR & RCC_PLL2DIVR_P2_Msk) >> RCC_PLL2DIVR_P2_Pos) + 1;
                case RCC_PLLDivider::DIVQ:  return ((RCC->PLL2DIVR & RCC_PLL2DIVR_Q2_Msk) >> RCC_PLL2DIVR_Q2_Pos) + 1;
                case RCC_PLLDivider::DIVR:  return ((RCC->PLL2DIVR & RCC_PLL2DIVR_R2_Msk) >> RCC_PLL2DIVR_R2_Pos) + 1;
            }
            break;
        case RCC_PLLID::PLL3:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  return ((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM3_Msk) >> RCC_PLLCKSELR_DIVM3_Pos);
                case RCC_PLLDivider::DIVN:  return ((RCC->PLL3DIVR & RCC_PLL3DIVR_N3_Msk) >> RCC_PLL3DIVR_N3_Pos) + 1;
                case RCC_PLLDivider::DIVP:  return ((RCC->PLL3DIVR & RCC_PLL3DIVR_P3_Msk) >> RCC_PLL3DIVR_P3_Pos) + 1;
                case RCC_PLLDivider::DIVQ:  return ((RCC->PLL3DIVR & RCC_PLL3DIVR_Q3_Msk) >> RCC_PLL3DIVR_Q3_Pos) + 1;
                case RCC_PLLDivider::DIVR:  return ((RCC->PLL3DIVR & RCC_PLL3DIVR_R3_Msk) >> RCC_PLL3DIVR_R3_Pos) + 1;
            }
            break;
    }
    return 0;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

