kavionic/PadOS/Kernel/HAL/STM32/ResetAndClockControl.cpp
uint32_t ResetAndClockControl::GetPLLOutFrequency(RCC_PLLID pll, RCC_PLLDivider divider)
{
    uint32_t frequency = 0;

    switch (GetPLLSource())
    {
        case RCC_PLLSource::HSI:    frequency = GetHSIFrequency();  break;
        case RCC_PLLSource::CSI:    frequency = 4000000;            break;
        case RCC_PLLSource::HSE:    frequency = s_HSEFrequency;     break;
        case RCC_PLLSource::None:   return 0;
    }

    const uint32_t divm = GetPLLDivider(pll, RCC_PLLDivider::DIVM);

    if (divm == 0) {
        return 0;
    }

    const uint32_t divn = GetPLLDivider(pll, RCC_PLLDivider::DIVN);
    const uint32_t divx = GetPLLDivider(pll, divider);

    return uint32_t(uint64_t(frequency) * divn / (divm * divx));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPLLOscillatorRange(RCC_PLLID pll, RCC_PLL_OscRange range)
{
    switch (pll)
    {
        case RCC_PLLID::PLL1:
            switch (range)
            {
                case RCC_PLL_OscRange::Wide:    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1VCOSEL;    break;
                case RCC_PLL_OscRange::Medium:  RCC->PLLCFGR |= RCC_PLLCFGR_PLL1VCOSEL;     break;
            }
            break;
        case RCC_PLLID::PLL2:
            switch (range)
            {
                case RCC_PLL_OscRange::Wide:    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL2VCOSEL;    break;
                case RCC_PLL_OscRange::Medium:  RCC->PLLCFGR |= RCC_PLLCFGR_PLL2VCOSEL;     break;
            }
            break;
        case RCC_PLLID::PLL3:
            switch (range)
            {
                case RCC_PLL_OscRange::Wide:    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL3VCOSEL;    break;
                case RCC_PLL_OscRange::Medium:  RCC->PLLCFGR |= RCC_PLLCFGR_PLL3VCOSEL;     break;
            }
            break;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPLLInputRange(RCC_PLLID pll, RCC_PLL_InputRange range)
{
    switch (pll)
    {
        case RCC_PLLID::PLL1:   set_bit_group(RCC->PLLCFGR, RCC_PLLCFGR_PLL1RGE_Msk, uint32_t(range) << RCC_PLLCFGR_PLL1RGE_Pos);   break;
        case RCC_PLLID::PLL2:   set_bit_group(RCC->PLLCFGR, RCC_PLLCFGR_PLL2RGE_Msk, uint32_t(range) << RCC_PLLCFGR_PLL2RGE_Pos);   break;
        case RCC_PLLID::PLL3:   set_bit_group(RCC->PLLCFGR, RCC_PLLCFGR_PLL3RGE_Msk, uint32_t(range) << RCC_PLLCFGR_PLL3RGE_Pos);   break;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::EnablePLLOutput(RCC_PLLID pll, RCC_PLLDivider divider, bool enable)
{
    uint32_t flag = 0;
    switch (pll)
    {
        case RCC_PLLID::PLL1:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  break;
                case RCC_PLLDivider::DIVN:  break;
                case RCC_PLLDivider::DIVP:  flag = RCC_PLLCFGR_DIVP1EN;    break;
                case RCC_PLLDivider::DIVQ:  flag = RCC_PLLCFGR_DIVQ1EN;    break;
                case RCC_PLLDivider::DIVR:  flag = RCC_PLLCFGR_DIVR1EN;    break;
            }
            break;
        case RCC_PLLID::PLL2:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  break;
                case RCC_PLLDivider::DIVN:  break;
                case RCC_PLLDivider::DIVP:  flag = RCC_PLLCFGR_DIVP2EN;    break;
                case RCC_PLLDivider::DIVQ:  flag = RCC_PLLCFGR_DIVQ2EN;    break;
                case RCC_PLLDivider::DIVR:  flag = RCC_PLLCFGR_DIVR2EN;    break;
            }
            break;
        case RCC_PLLID::PLL3:
            switch (divider)
            {
                case RCC_PLLDivider::DIVM:  break;
                case RCC_PLLDivider::DIVN:  break;
                case RCC_PLLDivider::DIVP:  flag = RCC_PLLCFGR_DIVP3EN;    break;
                case RCC_PLLDivider::DIVQ:  flag = RCC_PLLCFGR_DIVQ3EN;    break;
                case RCC_PLLDivider::DIVR:  flag = RCC_PLLCFGR_DIVR3EN;    break;
            }
            break;
        default:
            break;
    }
    if (enable)
    {
        RCC->PLLCFGR |= flag;
    }
    else
    {
        RCC->PLLCFGR &= ~flag;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::EnablePLL(RCC_PLLID pll, bool enable, bool wait)
{
    uint32_t flag = 0;
    switch (pll)
    {
        case RCC_PLLID::PLL1:   flag = RCC_CR_PLL1ON;   break;
        case RCC_PLLID::PLL2:   flag = RCC_CR_PLL2ON;   break;
        case RCC_PLLID::PLL3:   flag = RCC_CR_PLL3ON;   break;
    }
    if (enable)
    {
        RCC->CR |= flag;
        if (wait)
        {
            WaitForPLLStartup(pll);
        }
    }
    else
    {
        RCC->CR &= ~flag;
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

bool ResetAndClockControl::IsPLLEnabled(RCC_PLLID pll)
{
    uint32_t flag = 0;
    switch (pll)
    {
        case RCC_PLLID::PLL1:   flag = RCC_CR_PLL1ON;   break;
        case RCC_PLLID::PLL2:   flag = RCC_CR_PLL2ON;   break;
        case RCC_PLLID::PLL3:   flag = RCC_CR_PLL3ON;   break;
    }
    return (RCC->CR & flag) != 0;
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::WaitForPLLStartup(RCC_PLLID pll)
{
    uint32_t flag = 0;
    switch (pll)
    {
        case RCC_PLLID::PLL1:   flag = RCC_CR_PLL1RDY;   break;
        case RCC_PLLID::PLL2:   flag = RCC_CR_PLL2RDY;   break;
        case RCC_PLLID::PLL3:   flag = RCC_CR_PLL3RDY;   break;
    }
    if (flag != 0)
    {
        while ((RCC->CR & flag) == 0) {}
    }
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPrescaleHPRE(RCC_PrescaleHPRE scale)
{
    set_bit_group(RCC->D1CFGR, RCC_D1CFGR_HPRE_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPrescaleD1PPRE(RCC_PrescaleD1PPRE scale)
{
    set_bit_group(RCC->D1CFGR, RCC_D1CFGR_D1PPRE_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPrescaleD1CPRE(RCC_PrescaleD1CPRE scale)
{
    set_bit_group(RCC->D1CFGR, RCC_D1CFGR_D1CPRE_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

