kavionic/PadOS/Kernel/HAL/STM32/ResetAndClockControl.cpp
void ResetAndClockControl::SetPrescaleD2PPRE1(RCC_PrescaleD2PPRE1 scale)
{
    set_bit_group(RCC->D2CFGR, RCC_D2CFGR_D2PPRE1_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPrescaleD2PPRE2(RCC_PrescaleD2PPRE2 scale)
{
    set_bit_group(RCC->D2CFGR, RCC_D2CFGR_D2PPRE2_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SetPrescaleD3PPRE(RCC_PrescaleD3PPRE scale)
{
    set_bit_group(RCC->D3CFGR, RCC_D3CFGR_D3PPRE_Msk, uint32_t(scale));
}

///////////////////////////////////////////////////////////////////////////////
/// \author Kurt Skauen
///////////////////////////////////////////////////////////////////////////////

void ResetAndClockControl::SelectSysClock(RCC_SysClockSource source)
{
    set_bit_group(RCC->CFGR, RCC_CFGR_SW_Msk, uint32_t(source));
}



template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_FMCSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::HCLK },                                       // RCC_HCLK3
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVR }, // PLL2_R
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D1CCIPR, RCC_D1CCIPR_FMCSEL_Msk, RCC_D1CCIPR_FMCSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_QSPISEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::HCLK },                                       // RCC_HCLK3
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVR }, // PLL2_R
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D1CCIPR, RCC_D1CCIPR_QSPISEL_Msk, RCC_D1CCIPR_QSPISEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SDMMCSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVR }, // PLL2_R
    };
    return ClockMuxInfo(&RCC->D1CCIPR, RCC_D1CCIPR_SDMMCSEL_Msk, RCC_D1CCIPR_SDMMCSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_CKPERSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::HSI },    // HSI_KER
        { ST::CSI },    // CSI_KER
        { ST::HSE },    // HSE
    };
    return ClockMuxInfo(&RCC->D1CCIPR, RCC_D1CCIPR_CKPERSEL_Msk, RCC_D1CCIPR_CKPERSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SAI1SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVP }, // PLL3_P
        { ST::I2SCkin },                                    // I2S_CKIN
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SAI1SEL_Msk, RCC_D2CCIP1R_SAI1SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SAI23SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVP }, // PLL3_P
        { ST::I2SCkin },                                    // I2S_CKIN
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SAI23SEL_Msk, RCC_D2CCIP1R_SAI23SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SPI123SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVP }, // PLL3_P
        { ST::I2SCkin },                                    // I2S_CKIN
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SPI123SEL_Msk, RCC_D2CCIP1R_SPI123SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SPI45SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK2 },                                      // APB (PCLK2)
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ }, // PLL3_Q
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
        { ST::HSE },                                        // HSE_CK
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SPI45SEL_Msk, RCC_D2CCIP1R_SPI45SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SPDIFSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVR }, // PLL2_R
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::HSI },                                        // HSI_KER
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SPDIFSEL_Msk, RCC_D2CCIP1R_SPDIFSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_DFSDM1SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK2 },      // RCC_PCLK2
        { ST::SysClock },   // SYS_CK
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_DFSDM1SEL_Msk, RCC_D2CCIP1R_DFSDM1SEL_Pos, sources, std::size(sources));
}

