kavionic/PadOS/Kernel/HAL/STM32/ResetAndClockControl.cpp
template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_FDCANSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::HSE },                                        // HSE
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_FDCANSEL_Msk, RCC_D2CCIP1R_FDCANSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SWPSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK1 },  // PCLK (PCLK1)
        { ST::HSI },    // HSI_KER
    };
    return ClockMuxInfo(&RCC->D2CCIP1R, RCC_D2CCIP1R_SWPSEL_Msk, RCC_D2CCIP1R_SWPSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_USART16SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK2 },                                      // RCC_PCLK2
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ }, // PLL3_Q
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
        { ST::LSE },                                        // LSE
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_USART16SEL_Msk, RCC_D2CCIP2R_USART16SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_USART28SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK1 },                                      // RCC_PCLK1
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ }, // PLL3_Q
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
        { ST::LSE },                                        // LSE
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_USART28SEL_Msk, RCC_D2CCIP2R_USART28SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_RNGSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::HSI_div8 },                                   // HSI8 (HSI / 8)
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::LSE },                                        // LSE
        { ST::LSI },                                        // LSI
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_RNGSEL_Msk, RCC_D2CCIP2R_RNGSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_I2C123SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK1 },                                      // RCC_PCLK1
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_I2C123SEL_Msk, RCC_D2CCIP2R_I2C123SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_USBSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::Disabled },                                               // Disabled
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ },             // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ },             // PLL3_Q
        { ST::Fixed, RCC_PLLID::PLL1, RCC_PLLDivider::DIVP, 48000000 }, // HSI48
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_USBSEL_Msk, RCC_D2CCIP2R_USBSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_CECSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::LSE },    // LSE
        { ST::LSI },    // LSI
        { ST::CSI },    // CSI_KER
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_CECSEL_Msk, RCC_D2CCIP2R_CECSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_LPTIM1SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK1 },                                      // RCC_PCLK1
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::LSE },                                        // LSE
        { ST::LSI },                                        // LSI
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D2CCIP2R, RCC_D2CCIP2R_LPTIM1SEL_Msk, RCC_D2CCIP2R_LPTIM1SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_LPUART1SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK4 },                                      // RCC_PCLK_D3 (PCLK4)
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ }, // PLL3_Q
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
        { ST::LSE },                                        // LSE
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_LPUART1SEL_Msk, RCC_D3CCIPR_LPUART1SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_I2C4SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK4 },                                      // RCC_PCLK4
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_I2C4SEL_Msk, RCC_D3CCIPR_I2C4SEL_Pos, sources, std::size(sources));
}

