kavionic/PadOS/Kernel/HAL/STM32/ResetAndClockControl.cpp
template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_LPTIM2SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK4 },                                      // RCC_PCLK4
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::LSE },                                        // LSE
        { ST::LSI },                                        // LSI
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_LPTIM2SEL_Msk, RCC_D3CCIPR_LPTIM2SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_LPTIM345SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK4 },                                      // RCC_PCLK4
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::LSE },                                        // LSE
        { ST::LSI },                                        // LSI
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_LPTIM345SEL_Msk, RCC_D3CCIPR_LPTIM345SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SAI4ASEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVP }, // PLL3_P
        { ST::I2SCkin },                                    // I2S_CKIN
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_SAI4ASEL_Msk, RCC_D3CCIPR_SAI4ASEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SAI4BSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL1, RCC_PLLDivider::DIVQ }, // PLL1_Q
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVP }, // PLL3_P
        { ST::I2SCkin },                                    // I2S_CKIN
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_SAI4BSEL_Msk, RCC_D3CCIPR_SAI4BSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_ADCSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVP }, // PLL2_P
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVR }, // PLL3_R
        { ST::PeriphClock },                                // PERIPHERAL_CLK
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_ADCSEL_Msk, RCC_D3CCIPR_ADCSEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_SPI6SEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::PCLK4 },                                      // RCC_PCLK4
        { ST::PLL, RCC_PLLID::PLL2, RCC_PLLDivider::DIVQ }, // PLL2_Q
        { ST::PLL, RCC_PLLID::PLL3, RCC_PLLDivider::DIVQ }, // PLL3_Q
        { ST::HSI },                                        // HSI_KER
        { ST::CSI },                                        // CSI_KER
        { ST::HSE },                                        // HSE
    };
    return ClockMuxInfo(&RCC->D3CCIPR, RCC_D3CCIPR_SPI6SEL_Msk, RCC_D3CCIPR_SPI6SEL_Pos, sources, std::size(sources));
}

template<> ClockMuxInfo GetClockMuxInfo<RCC_ClockMux_RTCSEL>()
{
    using ST = ClockSourceInfo::SourceType;
    static const ClockSourceInfo sources[] = {
        { ST::Disabled },   // Disabled
        { ST::LSE },        // LSE
        { ST::LSI },        // LSI
        { ST::HSE_RTC },    // HSE / RTCPRE
    };
    return ClockMuxInfo(&RCC->BDCR, RCC_BDCR_RTCSEL_Msk, RCC_BDCR_RTCSEL_Pos, sources, std::size(sources));
}

#endif // STM32H7
